fduignan/stm32l432_nucleo/Serial/stm32l432.h
// STM32L432 register definitions.
// Not organized in any particular way, just as I found them useful
// No guarantees or claims of suitability,reliability or safety of any kind are implied or given
// All the values below were taken from the STM32L4x2 reference manual (RM0393)
// Also include macros for enabling and disabling global interrupts
// Written by Frank Duignan
// Dependencies : stdint.h 
// Changelog: Initial development : 8 March 2017
// Version 0.1 : USB not included due to discrepency between reference guide and datasheet 
//
// Define some bitmasks

#include <stdint.h>

#define BIT0 (1 << 0)
#define BIT1 (1 << 1)
#define BIT2 (1 << 2)
#define BIT3 (1 << 3)
#define BIT4 (1 << 4)
#define BIT5 (1 << 5)
#define BIT6 (1 << 6)
#define BIT7 (1 << 7)
#define BIT8 (1 << 8)
#define BIT9 (1 << 9)
#define BIT10 (1 << 10)
#define BIT11 (1 << 11)
#define BIT12 (1 << 12)
#define BIT13 (1 << 13)
#define BIT14 (1 << 14)
#define BIT15 (1 << 15)
#define BIT16 (1 << 16)
#define BIT17 (1 << 17)
#define BIT18 (1 << 18)
#define BIT19 (1 << 19)
#define BIT20 (1 << 20)
#define BIT21 (1 << 21)
#define BIT22 (1 << 22)
#define BIT23 (1 << 23)
#define BIT24 (1 << 24)
#define BIT25 (1 << 25)
#define BIT26 (1 << 26)
#define BIT27 (1 << 27)
#define BIT28 (1 << 28)
#define BIT29 (1 << 29)
#define BIT30 (1 << 30)
#define BIT31 (1 << 31)


// Macros to reduce typing later on
#define  REGISTER_32(ADDRESS) (*((volatile uint32_t *)(ADDRESS)))
#define  REGISTER_16(ADDRESS) (*((volatile uint16_t *)(ADDRESS)))
#define  REGISTER_8(ADDRESS) (*((volatile uint8_t *)(ADDRESS)))
// Macros to enable/disable global interrupts
#define enable_interrupts() asm(" cpsie i ")
#define disable_interrupts() asm(" cpsid i ")

// Boundary addresses for peripherals
// AHB1 
#define RNG_BASE        0x50060800
#define ADC_BASE        0x50040000
#define GPIOH_BASE      0x48001c00
#define GPIOC_BASE      0x48000800
#define GPIOB_BASE      0x48000400
#define GPIOA_BASE      0x48000000
#define TSC_BASE        0x40024000
#define CRC_BASE        0x40023000
#define FLASH_BASE      0x40022000
#define RCC_BASE        0x40021000
#define DMA2_BASE       0x40020400
#define DMA1_BASE       0x40020200
// APB2
#define SAI1_BASE       0x40015400
#define TIM16_BASE      0x40014400
#define TIM15_BASE      0x40014000
#define USART1_BASE     0x40013800
#define SPI1_BASE       0x40013000
#define TIM1_BASE       0x40012c00
#define FIREWALL_BASE   0x40011c00
#define EXTI_BASE       0x40010400
#define COMP_BASE       0x40010200
#define SYSCFG_BASE     0x40010000
// APB1
#define LPTIM2_BASE     0x40009400
#define SWPMI1_BASE     0x40008800
#define LPUART1_BASE    0x40008000
#define LPTIM1_BASE     0x40007c00
#define OPAMP_BASE      0x40007800
#define DAC_BASE        0x40007400
#define PWR_BASE        0x40007000
#define USB_SRAM_BASE   0x40006c00
// THE DATASHEET AND REFERENCE MANUAL DISAGREE ON THE BASE ADDRESS HERE.  
// Will hold off on USB declarations
#define USB_FS_BASE     0x40006800
#define CAN1_BASE       0x40006400
#define CRS_BASE        0x40006000
#define I2C3_BASE       0x40005c00
#define I2C1_BASE       0x40005400
#define USART2_BASE     0x40004400
#define SPI3_BASE       0x40003c00
#define IWDG_BASE       0x40003000
#define WWDG_BASE       0x40002c00
#define RTC_BASE        0x40002800
#define TIM7_BASE       0x40001400
#define TIM6_BASE       0x40001000
#define TIM2_BASE       0x40000000


// RNG (random number generator) registers
#define RNG_CR          REGISTER_32(RNG_BASE + 0x00)
#define RNG_SR          REGISTER_32(RNG_BASE + 0x04)
#define RNG_DR          REGISTER_32(RNG_BASE + 0x08)

// ADC1 
#define ADC1_ISR        REGISTER_32(ADC_BASE + 0x000 + 0)
#define ADC1_IER        REGISTER_32(ADC_BASE + 0x000 + 4)
#define ADC1_CR         REGISTER_32(ADC_BASE + 0x000 + 8)
#define ADC1_CFGR       REGISTER_32(ADC_BASE + 0x000 + 0x0c)
#define ADC1_CFGR2      REGISTER_32(ADC_BASE + 0x000 + 0x10)
#define ADC1_SMPR1      REGISTER_32(ADC_BASE + 0x000 + 0x14)
#define ADC1_SMPR2      REGISTER_32(ADC_BASE + 0x000 + 0x18)
#define ADC1_TR1        REGISTER_32(ADC_BASE + 0x000 + 0x20)
#define ADC1_TR2        REGISTER_32(ADC_BASE + 0x000 + 0x24)
#define ADC1_TR3        REGISTER_32(ADC_BASE + 0x000 + 0x28)
#define ADC1_SQR1       REGISTER_32(ADC_BASE + 0x000 + 0x30)
#define ADC1_SQR2       REGISTER_32(ADC_BASE + 0x000 + 0x34)
#define ADC1_SQR3       REGISTER_32(ADC_BASE + 0x000 + 0x38)
#define ADC1_SQR4       REGISTER_32(ADC_BASE + 0x000 + 0x3c)
#define ADC1_DR         REGISTER_32(ADC_BASE + 0x000 + 0x40)
#define ADC1_JSQR       REGISTER_32(ADC_BASE + 0x000 + 0x4c)
#define ADC1_OFR1       REGISTER_32(ADC_BASE + 0x000 + 0x60)
#define ADC1_OFR2       REGISTER_32(ADC_BASE + 0x000 + 0x64)
#define ADC1_OFR3       REGISTER_32(ADC_BASE + 0x000 + 0x68)
#define ADC1_OFR4       REGISTER_32(ADC_BASE + 0x000 + 0x6c)
#define ADC1_JDR1       REGISTER_32(ADC_BASE + 0x000 + 0x80)
#define ADC1_JDR2       REGISTER_32(ADC_BASE + 0x000 + 0x84)
#define ADC1_JDR3       REGISTER_32(ADC_BASE + 0x000 + 0x88)
#define ADC1_JDR4       REGISTER_32(ADC_BASE + 0x000 + 0x8c)
#define ADC1_AWD2CR     REGISTER_32(ADC_BASE + 0x000 + 0xa0)
#define ADC1_AWD3CR     REGISTER_32(ADC_BASE + 0x000 + 0xa4)
#define ADC1_DIFSEL     REGISTER_32(ADC_BASE + 0x000 + 0xb0)
#define ADC1_CALFACT    REGISTER_32(ADC_BASE + 0x000 + 0xb4)

#define ADC1_CSR        REGISTER_32(ADC_BASE +0x300 + 0x00)
#define ADC1_CCR        REGISTER_32(ADC_BASE +0x300 + 0x08)
#define ADC1_CDR        REGISTER_32(ADC_BASE +0x300 + 0x0c)


// PORT H
#define GPIOH_MODER     REGISTER_32(GPIOH_BASE + 0)
#define GPIOH_OTYPER    REGISTER_32(GPIOH_BASE + 4)
#define GPIOH_OSPEEDR   REGISTER_32(GPIOH_BASE + 8)
#define GPIOH_PUPDR     REGISTER_32(GPIOH_BASE + 0x0c)
#define GPIOH_IDR       REGISTER_32(GPIOH_BASE + 0x10)
#define GPIOH_ODR       REGISTER_32(GPIOH_BASE + 0x14)
#define GPIOH_BSRR      REGISTER_32(GPIOH_BASE + 0x18)
#define GPIOH_LCKR      REGISTER_32(GPIOH_BASE + 0x1c)
#define GPIOH_AFRL      REGISTER_32(GPIOH_BASE + 0x20)
#define GPIOH_AFRH      REGISTER_32(GPIOH_BASE + 0x24)
#define GPIOH_BRR       REGISTER_32(GPIOH_BASE + 0x28)

