fduignan/stm32l432_nucleo/Serial/stm32l432.h
// PORT C
#define GPIOC_MODER     REGISTER_32(GPIOC_BASE + 0)
#define GPIOC_OTYPER    REGISTER_32(GPIOC_BASE + 4)
#define GPIOC_OSPEEDR   REGISTER_32(GPIOC_BASE + 8)
#define GPIOC_PUPDR     REGISTER_32(GPIOC_BASE + 0x0c)
#define GPIOC_IDR       REGISTER_32(GPIOC_BASE + 0x10)
#define GPIOC_ODR       REGISTER_32(GPIOC_BASE + 0x14)
#define GPIOC_BSRR      REGISTER_32(GPIOC_BASE + 0x18)
#define GPIOC_LCKR      REGISTER_32(GPIOC_BASE + 0x1c)
#define GPIOC_AFRL      REGISTER_32(GPIOC_BASE + 0x20)
#define GPIOC_AFRH      REGISTER_32(GPIOC_BASE + 0x24)
#define GPIOC_BRR       REGISTER_32(GPIOC_BASE + 0x28)


// PORT B
#define GPIOB_MODER     REGISTER_32(GPIOB_BASE + 0)
#define GPIOB_OTYPER    REGISTER_32(GPIOB_BASE + 4)
#define GPIOB_OSPEEDR   REGISTER_32(GPIOB_BASE + 8)
#define GPIOB_PUPDR     REGISTER_32(GPIOB_BASE + 0x0c)
#define GPIOB_IDR       REGISTER_32(GPIOB_BASE + 0x10)
#define GPIOB_ODR       REGISTER_32(GPIOB_BASE + 0x14)
#define GPIOB_BSRR      REGISTER_32(GPIOB_BASE + 0x18)
#define GPIOB_LCKR      REGISTER_32(GPIOB_BASE + 0x1c)
#define GPIOB_AFRL      REGISTER_32(GPIOB_BASE + 0x20)
#define GPIOB_AFRH      REGISTER_32(GPIOB_BASE + 0x24)
#define GPIOB_BRR       REGISTER_32(GPIOB_BASE + 0x28)


// PORT A
#define GPIOA_MODER     REGISTER_32(GPIOA_BASE + 0)
#define GPIOA_OTYPER    REGISTER_32(GPIOA_BASE + 4)
#define GPIOA_OSPEEDR   REGISTER_32(GPIOA_BASE + 8)
#define GPIOA_PUPDR     REGISTER_32(GPIOA_BASE + 0x0c)
#define GPIOA_IDR       REGISTER_32(GPIOA_BASE + 0x10)
#define GPIOA_ODR       REGISTER_32(GPIOA_BASE + 0x14)
#define GPIOA_BSRR      REGISTER_32(GPIOA_BASE + 0x18)
#define GPIOA_LCKR      REGISTER_32(GPIOA_BASE + 0x1c)
#define GPIOA_AFRL      REGISTER_32(GPIOA_BASE + 0x20)
#define GPIOA_AFRH      REGISTER_32(GPIOA_BASE + 0x24)
#define GPIOA_BRR       REGISTER_32(GPIOA_BASE + 0x28)

// TSC
#define TS_CR           REGISTER_32(TSC_BASE + 0)
#define TSC_IER         REGISTER_32(TSC_BASE + 4)
#define TSC_ICR         REGISTER_32(TSC_BASE + 8)
#define TSC_ISR         REGISTER_32(TSC_BASE + 0x0c)
#define TSC_IOHCR       REGISTER_32(TSC_BASE + 0x10)
#define TSC_IOASCR      REGISTER_32(TSC_BASE + 0x18)
#define TSC_IOSCR       REGISTER_32(TSC_BASE + 0x20)
#define TSC_IOCCR       REGISTER_32(TSC_BASE + 0x28)
#define TSC_IOGCSR      REGISTER_32(TSC_BASE + 0x30)
#define TSC_IOG1CR      REGISTER_32(TSC_BASE + 0x34)
#define TSC_IOG2CR      REGISTER_32(TSC_BASE + 0x38)
#define TSC_IOG3CR      REGISTER_32(TSC_BASE + 0x3c)
#define TSC_IOG4CR      REGISTER_32(TSC_BASE + 0x40)
#define TSC_IOG5CR      REGISTER_32(TSC_BASE + 0x44)
#define TSC_IOG6CR      REGISTER_32(TSC_BASE + 0x48)
#define TSC_IOG7CR      REGISTER_32(TSC_BASE + 0x4c)

// CRC
#define CRC_DR          REGISTER_32(CRC_BASE + 0)
#define CRC_IDR         REGISTER_32(CRC_BASE + 4)
#define CRC_CR          REGISTER_32(CRC_BASE + 8)
#define CRC_INIT        REGISTER_32(CRC_BASE + 0x10)
#define CRC_POL         REGISTER_32(CRC_BASE + 0x14)

// FLASH
#define FLASH_ACR       REGISTER_32(FLASH_BASE + 0x00)
#define FLASH_PDKEYR    REGISTER_32(FLASH_BASE + 0x04)
#define FLASH_KEYR      REGISTER_32(FLASH_BASE + 0x08)
#define FLASH_OPTKEYR   REGISTER_32(FLASH_BASE + 0x0c)
#define FLASH_SR        REGISTER_32(FLASH_BASE + 0x10)
#define FLASH_CR        REGISTER_32(FLASH_BASE + 0x14)
#define FLASH_ECCR      REGISTER_32(FLASH_BASE + 0x18)
#define FLASH_OPTR      REGISTER_32(FLASH_BASE + 0x20)
#define FLASH_PCPROP1SR REGISTER_32(FLASH_BASE + 0x24)
#define FLASH_PCPROP1ER REGISTER_32(FLASH_BASE + 0x28)
#define FLASH_WRP1AR    REGISTER_32(FLASH_BASE + 0x2c)
#define FLASH_WRP1BR    REGISTER_32(FLASH_BASE + 0x30)

// RCC registers
#define RCC_CR          REGISTER_32(RCC_BASE + 0x00)
#define RCC_ICSCR       REGISTER_32(RCC_BASE + 0x04)
#define RCC_CFGR        REGISTER_32(RCC_BASE + 0x08)
#define RCC_PLLCFGR     REGISTER_32(RCC_BASE + 0x0c)
#define RCC_PLLSAI1CFGR REGISTER_32(RCC_BASE + 0x10)
#define RCC_CIER        REGISTER_32(RCC_BASE + 0x18)
#define RCC_CIFR        REGISTER_32(RCC_BASE + 0x1c)
#define RCC_CICR        REGISTER_32(RCC_BASE + 0x20)
#define RCC_AHB1RSTR    REGISTER_32(RCC_BASE + 0x28)
#define RCC_AHB2RSTR    REGISTER_32(RCC_BASE + 0x2c)
#define RCC_AHB3RSTR    REGISTER_32(RCC_BASE + 0x30)
#define RCC_APB1RSTR1   REGISTER_32(RCC_BASE + 0x38)
#define RCC_APB1RSTR2   REGISTER_32(RCC_BASE + 0x3c)
#define RCC_APB2RSTR    REGISTER_32(RCC_BASE + 0x40)
#define RCC_AHB1ENR     REGISTER_32(RCC_BASE + 0x48)
#define RCC_AHB2ENR     REGISTER_32(RCC_BASE + 0x4c)
#define RCC_AHB3ENR     REGISTER_32(RCC_BASE + 0x50)
#define RCC_APB1ENR1    REGISTER_32(RCC_BASE + 0x58)
#define RCC_APB1ENR2    REGISTER_32(RCC_BASE + 0x5c)
#define RCC_APB2ENR     REGISTER_32(RCC_BASE + 0x60)
#define RCC_AHB1SMENR   REGISTER_32(RCC_BASE + 0x68)
#define RCC_AHB2SMENR   REGISTER_32(RCC_BASE + 0x6c)
#define RCC_AHB3SMENR   REGISTER_32(RCC_BASE + 0x70)
#define RCC_APB1SMENR1  REGISTER_32(RCC_BASE + 0x78)
#define RCC_APB1SMENR2  REGISTER_32(RCC_BASE + 0x7c)
#define RCC_APB2SMENR   REGISTER_32(RCC_BASE + 0x80)
#define RCC_CCIPR       REGISTER_32(RCC_BASE + 0x88)
#define RCC_BDCR        REGISTER_32(RCC_BASE + 0x90)
#define RCC_CSR         REGISTER_32(RCC_BASE + 0x94)
#define RCC_CRRCR       REGISTER_32(RCC_BASE + 0x98)


// DMA2
#define DMA2_ISR        REGISTER_32(DMA2_BASE + 0)
#define DMA2_IFCR       REGISTER_32(DMA2_BASE + 4)
#define DMA2_CCR1       REGISTER_32(DMA2_BASE + 8)
#define DMA2_CNDTR1     REGISTER_32(DMA2_BASE + 0x0c)
#define DMA2_CPAR1      REGISTER_32(DMA2_BASE + 0x10)
#define DMA2_CMAR1      REGISTER_32(DMA2_BASE + 0x14)
#define DMA2_CCR2       REGISTER_32(DMA2_BASE + 0x1c)
#define DMA2_CNDTR2     REGISTER_32(DMA2_BASE + 0x20)
#define DMA2_CPAR2      REGISTER_32(DMA2_BASE + 0x24)
#define DMA2_CMAR2      REGISTER_32(DMA2_BASE + 0x28)
#define DMA2_CCR3       REGISTER_32(DMA2_BASE + 0x30)
#define DMA2_CNDTR3     REGISTER_32(DMA2_BASE + 0x34)
#define DMA2_CPAR3      REGISTER_32(DMA2_BASE + 0x38)
#define DMA2_CMAR3      REGISTER_32(DMA2_BASE + 0x3c)
#define DMA2_CCR4       REGISTER_32(DMA2_BASE + 0x44)
#define DMA2_CNDTR4     REGISTER_32(DMA2_BASE + 0x48)
#define DMA2_CPAR4      REGISTER_32(DMA2_BASE + 0x4c)
#define DMA2_CMAR4      REGISTER_32(DMA2_BASE + 0x50)
#define DMA2_CCR5       REGISTER_32(DMA2_BASE + 0x58)
#define DMA2_CNDTR5     REGISTER_32(DMA2_BASE + 0x5c)
#define DMA2_CPAR5      REGISTER_32(DMA2_BASE + 0x60)
#define DMA2_CMAR5      REGISTER_32(DMA2_BASE + 0x64)
#define DMA2_CCR6       REGISTER_32(DMA2_BASE + 0x6c)
#define DMA2_CNDTR6     REGISTER_32(DMA2_BASE + 0x70)
#define DMA2_CPAR6      REGISTER_32(DMA2_BASE + 0x74)
#define DMA2_CMAR6      REGISTER_32(DMA2_BASE + 0x78)
#define DMA2_CCR7       REGISTER_32(DMA2_BASE + 0x80)
#define DMA2_CNDTR7     REGISTER_32(DMA2_BASE + 0x84)
#define DMA2_CPAR7      REGISTER_32(DMA2_BASE + 0x88)
#define DMA2_CMAR7      REGISTER_32(DMA2_BASE + 0x8c)
#define DMA2_CSELR      REGISTER_32(DMA2_BASE + 0xa8)


// DMA1
#define DMA1_ISR        REGISTER_32(DMA1_BASE + 0)
#define DMA1_IFCR       REGISTER_32(DMA1_BASE + 4)
#define DMA1_CCR1       REGISTER_32(DMA1_BASE + 8)
#define DMA1_CNDTR1     REGISTER_32(DMA1_BASE + 0x0c)
#define DMA1_CPAR1      REGISTER_32(DMA1_BASE + 0x10)
#define DMA1_CMAR1      REGISTER_32(DMA1_BASE + 0x14)
#define DMA1_CCR2       REGISTER_32(DMA1_BASE + 0x1c)
#define DMA1_CNDTR2     REGISTER_32(DMA1_BASE + 0x20)
#define DMA1_CPAR2      REGISTER_32(DMA1_BASE + 0x24)
#define DMA1_CMAR2      REGISTER_32(DMA1_BASE + 0x28)
#define DMA1_CCR3       REGISTER_32(DMA1_BASE + 0x30)
#define DMA1_CNDTR3     REGISTER_32(DMA1_BASE + 0x34)
#define DMA1_CPAR3      REGISTER_32(DMA1_BASE + 0x38)
#define DMA1_CMAR3      REGISTER_32(DMA1_BASE + 0x3c)
#define DMA1_CCR4       REGISTER_32(DMA1_BASE + 0x44)
#define DMA1_CNDTR4     REGISTER_32(DMA1_BASE + 0x48)
#define DMA1_CPAR4      REGISTER_32(DMA1_BASE + 0x4c)
#define DMA1_CMAR4      REGISTER_32(DMA1_BASE + 0x50)
#define DMA1_CCR5       REGISTER_32(DMA1_BASE + 0x58)
#define DMA1_CNDTR5     REGISTER_32(DMA1_BASE + 0x5c)
#define DMA1_CPAR5      REGISTER_32(DMA1_BASE + 0x60)
#define DMA1_CMAR5      REGISTER_32(DMA1_BASE + 0x64)
#define DMA1_CCR6       REGISTER_32(DMA1_BASE + 0x6c)
#define DMA1_CNDTR6     REGISTER_32(DMA1_BASE + 0x70)
#define DMA1_CPAR6      REGISTER_32(DMA1_BASE + 0x74)
#define DMA1_CMAR6      REGISTER_32(DMA1_BASE + 0x78)
#define DMA1_CCR7       REGISTER_32(DMA1_BASE + 0x80)
#define DMA1_CNDTR7     REGISTER_32(DMA1_BASE + 0x84)
#define DMA1_CPAR7      REGISTER_32(DMA1_BASE + 0x88)
#define DMA1_CMAR7      REGISTER_32(DMA1_BASE + 0x8c)
#define DMA1_CSELR      REGISTER_32(DMA1_BASE + 0xa8)


// SAI (Serial Audio Interface)
#define SAI_GCR         REGISTER_32(SAI_BASE + 0x0000)
#define SAI_1CR1        REGISTER_32(SAI_BASE + 0x0004)
#define SAI_1CR2        REGISTER_32(SAI_BASE + 0x0008)
#define SAI_1FRCR       REGISTER_32(SAI_BASE + 0x000c)
#define SAI_1SLOTR      REGISTER_32(SAI_BASE + 0x0010)
#define SAI_1IM         REGISTER_32(SAI_BASE + 0x0014)
#define SAI_1SR         REGISTER_32(SAI_BASE + 0x0018)
#define SAI_1CLRFR      REGISTER_32(SAI_BASE + 0x001c)
#define SAI_1DR         REGISTER_32(SAI_BASE + 0x0020)

