fduignan/stm32l432_nucleo/Serial/stm32l432.h
// Timer 16
#define TIM16_CR1       REGISTER_32(TIM16_BASE + 0)
#define TIM16_CR2       REGISTER_32(TIM16_BASE + 4)
#define TIM16_DIER      REGISTER_32(TIM16_BASE + 0x0c)
#define TIM16_SR        REGISTER_32(TIM16_BASE + 0x10)
#define TIM16_EGR       REGISTER_32(TIM16_BASE + 0x14)
#define TIM16_CCMR1     REGISTER_32(TIM16_BASE + 0x18)
#define TIM16_CCER      REGISTER_32(TIM16_BASE + 0x20)
#define TIM16_CNT       REGISTER_32(TIM16_BASE + 0x24)
#define TIM16_PSC       REGISTER_32(TIM16_BASE + 0x28)
#define TIM16_ARR       REGISTER_32(TIM16_BASE + 0x2c)
#define TIM16_RCR       REGISTER_32(TIM16_BASE + 0x30)
#define TIM16_CCR1      REGISTER_32(TIM16_BASE + 0x34)
#define TIM16_BDTR      REGISTER_32(TIM16_BASE + 0x44)
#define TIM16_DCR       REGISTER_32(TIM16_BASE + 0x48)
#define TIM16_DMAR      REGISTER_32(TIM16_BASE + 0x4c)
#define TIM16_OR1       REGISTER_32(TIM16_BASE + 0x50)
#define TIM16_OR2       REGISTER_32(TIM16_BASE + 0x60)

// Timer 15
#define TIM15_CR1       REGISTER_32(TIM15_BASE + 0)
#define TIM15_CR2       REGISTER_32(TIM15_BASE + 4)
#define TIM15_SMCR      REGISTER_32(TIM15_BASE + 8)
#define TIM15_DIER      REGISTER_32(TIM15_BASE + 0x0c)
#define TIM15_SR        REGISTER_32(TIM15_BASE + 0x10)
#define TIM15_EGR       REGISTER_32(TIM15_BASE + 0x14)
#define TIM15_CCMR1     REGISTER_32(TIM15_BASE + 0x18)
#define TIM15_CCER      REGISTER_32(TIM15_BASE + 0x20)
#define TIM15_CNT       REGISTER_32(TIM15_BASE + 0x24)
#define TIM15_PSC       REGISTER_32(TIM15_BASE + 0x28)
#define TIM15_ARR       REGISTER_32(TIM15_BASE + 0x2c)
#define TIM15_RCR       REGISTER_32(TIM15_BASE + 0x30)
#define TIM15_CCR1      REGISTER_32(TIM15_BASE + 0x34)
#define TIM15_CCR2      REGISTER_32(TIM15_BASE + 0x38)
#define TIM15_BDTR      REGISTER_32(TIM15_BASE + 0x44)
#define TIM15_DCR       REGISTER_32(TIM15_BASE + 0x48)
#define TIM15_DMAR      REGISTER_32(TIM15_BASE + 0x4c)
#define TIM15_OR1       REGISTER_32(TIM15_BASE + 0x50)
#define TIM15_OR2       REGISTER_32(TIM15_BASE + 0x60)

// USART1
#define USART1_CR1      REGISTER_32(USART1_BASE + 0)
#define USART1_CR2      REGISTER_32(USART1_BASE + 4)
#define USART1_CR3      REGISTER_32(USART1_BASE + 8)
#define USART1_BRR      REGISTER_32(USART1_BASE + 0x0c)
#define USART1_GTPR     REGISTER_32(USART1_BASE + 0x10)
#define USART1_RTOR     REGISTER_32(USART1_BASE + 0x14)
#define USART1_RQR      REGISTER_32(USART1_BASE + 0x18)
#define USART1_ISR      REGISTER_32(USART1_BASE + 0x1c)
#define USART1_ICR      REGISTER_32(USART1_BASE + 0x20)
#define USART1_RDR      REGISTER_32(USART1_BASE + 0x24)
#define USART1_TDR      REGISTER_32(USART1_BASE + 0x28)


// SPI1 Note the memory access sizes
#define SPI1_CR1        REGISTER_32(SPI1_BASE + 0)
#define SPI1_CR2        REGISTER_32(SPI1_BASE + 4)
#define SPI1_SR         REGISTER_32(SPI1_BASE + 8)
#define SPI1_DR         REGISTER_16(SPI1_BASE + 0x0c)
#define SPI1_DR8        REGISTER_8(SPI1_BASE + 0x0c)
#define SPI1_CRCPR      REGISTER_32(SPI1_BASE + 0x10)
#define SPI1_RXCRCR     REGISTER_32(SPI1_BASE + 0x14)
#define SPI1_TXCRCR     REGISTER_32(SPI1_BASE + 0x18)

// Timer 1
#define TIM1_CR1        REGISTER_32(TIM1_BASE + 0)
#define TIM1_CR2        REGISTER_32(TIM1_BASE + 4)
#define TIM1_SMCR       REGISTER_32(TIM1_BASE + 8)
#define TIM1_DIER       REGISTER_32(TIM1_BASE + 0x0c)
#define TIM1_SR         REGISTER_32(TIM1_BASE + 0x10)
#define TIM1_EGR        REGISTER_32(TIM1_BASE + 0x14)
#define TIM1_CCMR1      REGISTER_32(TIM1_BASE + 0x18)
#define TIM1_CCMR2      REGISTER_32(TIM1_BASE + 0x1c)
#define TIM1_CCER       REGISTER_32(TIM1_BASE + 0x20)
#define TIM1_CNT        REGISTER_32(TIM1_BASE + 0x24)
#define TIM1_PSC        REGISTER_32(TIM1_BASE + 0x28)
#define TIM1_ARR        REGISTER_32(TIM1_BASE + 0x2c)
#define TIM1_RCR        REGISTER_32(TIM1_BASE + 0x30)
#define TIM1_CCR1       REGISTER_32(TIM1_BASE + 0x34)
#define TIM1_CCR2       REGISTER_32(TIM1_BASE + 0x38)
#define TIM1_CCR3       REGISTER_32(TIM1_BASE + 0x3c)
#define TIM1_CCR4       REGISTER_32(TIM1_BASE + 0x40)
#define TIM1_BDTR       REGISTER_32(TIM1_BASE + 0x44)
#define TIM1_DCR        REGISTER_32(TIM1_BASE + 0x48)
#define TIM1_DMAR       REGISTER_32(TIM1_BASE + 0x4c)
#define TIM1_OR1        REGISTER_32(TIM1_BASE + 0x50)
#define TIM1_CCMR3      REGISTER_32(TIM1_BASE + 0x54)
#define TIM1_CCR5       REGISTER_32(TIM1_BASE + 0x58)
#define TIM1_CCR6       REGISTER_32(TIM1_BASE + 0x5c)
#define TIM1_OR2        REGISTER_32(TIM1_BASE + 0x60)
#define TIM1_OR3        REGISTER_32(TIM1_BASE + 0x64)


// FIREWALL
#define FW_CSSA         REGISTER_32(FIREWALL_BASE + 0x00)
#define FW_CSL          REGISTER_32(FIREWALL_BASE + 0x04)
#define FW_NVDSSA       REGISTER_32(FIREWALL_BASE + 0x08)
#define FW_NVDSL        REGISTER_32(FIREWALL_BASE + 0x0c)
#define FW_VDSSA        REGISTER_32(FIREWALL_BASE + 0x10)
#define FW_VDSL         REGISTER_32(FIREWALL_BASE + 0x14)


// EXTI	
#define EXTI_IMR1       REGISTER_32(EXTI_BASE + 0)
#define EXTI_EMR1       REGISTER_32(EXTI_BASE + 4)
#define EXTI_RTSR1      REGISTER_32(EXTI_BASE + 8)
#define EXTI_FTSR1      REGISTER_32(EXTI_BASE + 0x0c)
#define EXTI_SWIER1     REGISTER_32(EXTI_BASE + 0x10)
#define EXTI_PR1        REGISTER_32(EXTI_BASE + 0x14)
#define EXTI_IMR2       REGISTER_32(EXTI_BASE + 0x20)
#define EXTI_EMR2       REGISTER_32(EXTI_BASE + 0x24)
#define EXTI_RTSR2      REGISTER_32(EXTI_BASE + 0x28)
#define EXTI_FTSR2      REGISTER_32(EXTI_BASE + 0x2c)
#define EXTI_SWIER2     REGISTER_32(EXTI_BASE + 0x30)
#define EXTI_PR2        REGISTER_32(EXTI_BASE + 0x34)


// COMP 
#define COMP1_CSR       REGISTER_32(COMP_BASE + 0x1c)
#define COMP2_CSR       REGISTER_32(COMP_BASE + 0x20)

// SYS Config
#define SYSCFG_MEMRMP   REGISTER_32(SYSCFG_BASE + 0)
#define SYSCFG_CFGR1    REGISTER_32(SYSCFG_BASE + 4)
#define SYSCFG_EXTICR1  REGISTER_32(SYSCFG_BASE + 8)
#define SYSCFG_EXTICR2  REGISTER_32(SYSCFG_BASE + 0x0c)
#define SYSCFG_EXTICR3  REGISTER_32(SYSCFG_BASE + 0x10)
#define SYSCFG_EXTICR4  REGISTER_32(SYSCFG_BASE + 0x14)
#define SYSCFG_SCSR     REGISTER_32(SYSCFG_BASE + 0x18)
#define SYSCFG_CFGR2    REGISTER_32(SYSCFG_BASE + 0x1c)
#define SYSCFG_SWPR     REGISTER_32(SYSCFG_BASE + 0x20)
#define SYSCFG_SKR      REGISTER_32(SYSCFG_BASE + 0x24)

