fduignan/stm32l432_nucleo/Serial/stm32l432.h
// LPTIM2
#define LPTIM2_ISR      REGISTER_32(LPTIM2_BASE + 0x00)
#define LPTIM2_ICR      REGISTER_32(LPTIM2_BASE + 0x04)
#define LPTIM2_IER      REGISTER_32(LPTIM2_BASE + 0x08)
#define LPTIM2_CFGR     REGISTER_32(LPTIM2_BASE + 0x0c)
#define LPTIM2_CR       REGISTER_32(LPTIM2_BASE + 0x10)
#define LPTIM2_CMP      REGISTER_32(LPTIM2_BASE + 0x14)
#define LPTIM2_ARR      REGISTER_32(LPTIM2_BASE + 0x18)
#define LPTIM2_CNT      REGISTER_32(LPTIM2_BASE + 0x1c)
#define LPTIM2_OR       REGISTER_32(LPTIM2_BASE + 0x20)

// OP-AMP
#define OPAMP1_CSR      REGISTER_32(OPAMP_BASE + 0x00)
#define OPAMP1_OTR      REGISTER_32(OPAMP_BASE + 0x04)
#define OPAMP1_LPOTR    REGISTER_32(OPAMP_BASE + 0x08)

// DAC 
#define DAC_CR          REGISTER_32(DAC_BASE + 0x00)
#define DAC_SWTRGR      REGISTER_32(DAC_BASE + 0x04)
#define DAC_DHR12R1     REGISTER_32(DAC_BASE + 0x08)
#define DAC_DHR12L1     REGISTER_32(DAC_BASE + 0x0c)
#define DAC_DHR8R1      REGISTER_32(DAC_BASE + 0x10)
#define DAC_DHR12R2     REGISTER_32(DAC_BASE + 0x14)
#define DAC_DHR12L2     REGISTER_32(DAC_BASE + 0x18)
#define DAC_DHR8R2      REGISTER_32(DAC_BASE + 0x1c)
#define DAC_DHR12RD     REGISTER_32(DAC_BASE + 0x20)
#define DAC_DHR12LD     REGISTER_32(DAC_BASE + 0x24)
#define DAC_DHR8RD      REGISTER_32(DAC_BASE + 0x28)
#define DAC_DOR1        REGISTER_32(DAC_BASE + 0x2c)
#define DAC_DOR2        REGISTER_32(DAC_BASE + 0x30)
#define DAC_SR          REGISTER_32(DAC_BASE + 0x34)
#define DAC_CCR         REGISTER_32(DAC_BASE + 0x38)
#define DAC_MCR         REGISTER_32(DAC_BASE + 0x3c)
#define DAC_SHSR1       REGISTER_32(DAC_BASE + 0x40)
#define DAC_SHSR2       REGISTER_32(DAC_BASE + 0x44)
#define DAC_SHHR        REGISTER_32(DAC_BASE + 0x48)
#define DAC_SHRR        REGISTER_32(DAC_BASE + 0x4c)


// PWR 
#define PWR_CR1         REGISTER_32(PWR_BASE + 0x000)
#define PWR_CR2         REGISTER_32(PWR_BASE + 0x004)
#define PWR_CR3         REGISTER_32(PWR_BASE + 0x008)
#define PWR_CR4         REGISTER_32(PWR_BASE + 0x00c)
#define PWR_SR1         REGISTER_32(PWR_BASE + 0x010)
#define PWR_SR2         REGISTER_32(PWR_BASE + 0x014)
#define PWR_SCR         REGISTER_32(PWR_BASE + 0x018)
#define PWR_PUCRA       REGISTER_32(PWR_BASE + 0x020)
#define PWR_PDCRA       REGISTER_32(PWR_BASE + 0x024)
#define PWR_PUCRB       REGISTER_32(PWR_BASE + 0x028)
#define PWR_PDCRB       REGISTER_32(PWR_BASE + 0x02c)
#define PWR_PUCRC       REGISTER_32(PWR_BASE + 0x030)
#define PWR_PDCRC       REGISTER_32(PWR_BASE + 0x034)
#define PWR_PUCRD       REGISTER_32(PWR_BASE + 0x038)
#define PWR_PDCRD       REGISTER_32(PWR_BASE + 0x03c)
#define PWR_PUCRE       REGISTER_32(PWR_BASE + 0x040)
#define PWR_PDCRE       REGISTER_32(PWR_BASE + 0x044)
#define PWR_PUCRF       REGISTER_32(PWR_BASE + 0x048)
#define PWR_PDCRF       REGISTER_32(PWR_BASE + 0x04c)
#define PWR_PUCRG       REGISTER_32(PWR_BASE + 0x050)
#define PWR_PDCRG       REGISTER_32(PWR_BASE + 0x054)
#define PWR_PUCRH       REGISTER_32(PWR_BASE + 0x058)
#define PWR_PDCRH       REGISTER_32(PWR_BASE + 0x05c)

// USB_FS_BASE  NOT IMPLEMENTED YET - PROBLEM WITH DATASHEET / REFERENCE GUIDE

// CAN
#define CAN_MCR         REGISTER_32(CAN1_BASE + 0x000)
#define CAN_MSR         REGISTER_32(CAN1_BASE + 0x004)
#define CAN_TSR         REGISTER_32(CAN1_BASE + 0x008)
#define CAN_RF0R        REGISTER_32(CAN1_BASE + 0x00c)
#define CAN_RF1R        REGISTER_32(CAN1_BASE + 0x010)
#define CAN_IER         REGISTER_32(CAN1_BASE + 0x014)
#define CAN_ESR         REGISTER_32(CAN1_BASE + 0x018)
#define CAN_BTR         REGISTER_32(CAN1_BASE + 0x01c)
#define CAN_TI0R        REGISTER_32(CAN1_BASE + 0x180)
#define CAN_TDT0R       REGISTER_32(CAN1_BASE + 0x184)
#define CAN_TDL0R       REGISTER_32(CAN1_BASE + 0x188)
#define CAN_TDH0R       REGISTER_32(CAN1_BASE + 0x18c)
#define CAN_TI1R        REGISTER_32(CAN1_BASE + 0x190)
#define CAN_TDT1R       REGISTER_32(CAN1_BASE + 0x194)
#define CAN_TDL1R       REGISTER_32(CAN1_BASE + 0x198)
#define CAN_TDH1R       REGISTER_32(CAN1_BASE + 0x19c)
#define CAN_TI2R        REGISTER_32(CAN1_BASE + 0x1a0)
#define CAN_TDT2R       REGISTER_32(CAN1_BASE + 0x1a4)
#define CAN_TDL2R       REGISTER_32(CAN1_BASE + 0x1a8)
#define CAN_TDH2R       REGISTER_32(CAN1_BASE + 0x1ac)
#define CAN_RI0R        REGISTER_32(CAN1_BASE + 0x1b0)
#define CAN_RDT0R       REGISTER_32(CAN1_BASE + 0x1b4)
#define CAN_RDL0R       REGISTER_32(CAN1_BASE + 0x1b8)
#define CAN_RDH0R       REGISTER_32(CAN1_BASE + 0x1bc)
#define CAN_RI1R        REGISTER_32(CAN1_BASE + 0x1c0)
#define CAN_RDT1R       REGISTER_32(CAN1_BASE + 0x1c4)
#define CAN_RDL1R       REGISTER_32(CAN1_BASE + 0x1c8)
#define CAN_RDH1R       REGISTER_32(CAN1_BASE + 0x1cc)
#define CAN_FMR         REGISTER_32(CAN1_BASE + 0x200)
#define CAN_FM1R        REGISTER_32(CAN1_BASE + 0x204)
#define CAN_FS1R        REGISTER_32(CAN1_BASE + 0x20c)
#define CAN_FFA1R       REGISTER_32(CAN1_BASE + 0x214)
#define CAN_FA1R        REGISTER_32(CAN1_BASE + 0x21c)

#define CAN_F0R1        REGISTER_32(CAN1_BASE + 0x240)
#define CAN_F0R2        REGISTER_32(CAN1_BASE + 0x244)
#define CAN_F1R1        REGISTER_32(CAN1_BASE + 0x248)
#define CAN_F1R2        REGISTER_32(CAN1_BASE + 0x24c)
#define CAN_F2R1        REGISTER_32(CAN1_BASE + 0x250)
#define CAN_F2R2        REGISTER_32(CAN1_BASE + 0x254)
#define CAN_F3R1        REGISTER_32(CAN1_BASE + 0x258)
#define CAN_F3R2        REGISTER_32(CAN1_BASE + 0x25c)
#define CAN_F4R1        REGISTER_32(CAN1_BASE + 0x260)
#define CAN_F4R2        REGISTER_32(CAN1_BASE + 0x264)
#define CAN_F5R1        REGISTER_32(CAN1_BASE + 0x268)
#define CAN_F5R2        REGISTER_32(CAN1_BASE + 0x26c)
#define CAN_F6R1        REGISTER_32(CAN1_BASE + 0x270)
#define CAN_F6R2        REGISTER_32(CAN1_BASE + 0x274)
#define CAN_F7R1        REGISTER_32(CAN1_BASE + 0x278)
#define CAN_F7R2        REGISTER_32(CAN1_BASE + 0x27c)
#define CAN_F8R1        REGISTER_32(CAN1_BASE + 0x280)
#define CAN_F8R2        REGISTER_32(CAN1_BASE + 0x284)
#define CAN_F9R1        REGISTER_32(CAN1_BASE + 0x288)
#define CAN_F9R2        REGISTER_32(CAN1_BASE + 0x28c)
#define CAN_F10R1       REGISTER_32(CAN1_BASE + 0x290)
#define CAN_F10R2       REGISTER_32(CAN1_BASE + 0x294)
#define CAN_F11R1       REGISTER_32(CAN1_BASE + 0x298)
#define CAN_F11R2       REGISTER_32(CAN1_BASE + 0x29c)
#define CAN_F12R1       REGISTER_32(CAN1_BASE + 0x2a0)
#define CAN_F12R2       REGISTER_32(CAN1_BASE + 0x2a4)
#define CAN_F13R1       REGISTER_32(CAN1_BASE + 0x2a8)
#define CAN_F13R2       REGISTER_32(CAN1_BASE + 0x2ac)
#define CAN_F14R1       REGISTER_32(CAN1_BASE + 0x2b0)
#define CAN_F14R2       REGISTER_32(CAN1_BASE + 0x2b4)
#define CAN_F15R1       REGISTER_32(CAN1_BASE + 0x2b8)
#define CAN_F15R2       REGISTER_32(CAN1_BASE + 0x2bc)
#define CAN_F16R1       REGISTER_32(CAN1_BASE + 0x2c0)
#define CAN_F16R2       REGISTER_32(CAN1_BASE + 0x2c4)
#define CAN_F17R1       REGISTER_32(CAN1_BASE + 0x2c8)
#define CAN_F17R2       REGISTER_32(CAN1_BASE + 0x2cc)
#define CAN_F18R1       REGISTER_32(CAN1_BASE + 0x2d0)
#define CAN_F18R2       REGISTER_32(CAN1_BASE + 0x2d4)
#define CAN_F19R1       REGISTER_32(CAN1_BASE + 0x2d8)
#define CAN_F19R2       REGISTER_32(CAN1_BASE + 0x2dc)
#define CAN_F20R1       REGISTER_32(CAN1_BASE + 0x2e0)
#define CAN_F20R2       REGISTER_32(CAN1_BASE + 0x2e4)
#define CAN_F21R1       REGISTER_32(CAN1_BASE + 0x2e8)
#define CAN_F21R2       REGISTER_32(CAN1_BASE + 0x2ec)
#define CAN_F22R1       REGISTER_32(CAN1_BASE + 0x2f0)
#define CAN_F22R2       REGISTER_32(CAN1_BASE + 0x2f4)
#define CAN_F23R1       REGISTER_32(CAN1_BASE + 0x2f8)
#define CAN_F23R2       REGISTER_32(CAN1_BASE + 0x2fc)
#define CAN_F24R1       REGISTER_32(CAN1_BASE + 0x300)
#define CAN_F24R2       REGISTER_32(CAN1_BASE + 0x304)
#define CAN_F25R1       REGISTER_32(CAN1_BASE + 0x308)
#define CAN_F25R2       REGISTER_32(CAN1_BASE + 0x30c)
#define CAN_F26R1       REGISTER_32(CAN1_BASE + 0x310)
#define CAN_F26R2       REGISTER_32(CAN1_BASE + 0x314)
#define CAN_F27R1       REGISTER_32(CAN1_BASE + 0x318)
#define CAN_F27R2       REGISTER_32(CAN1_BASE + 0x31c)


// CRS (Clock recovery system)
#define CRS_CR          REGISTER_32(CRS_BASE + 0x00)
#define CRS_CFGR        REGISTER_32(CRS_BASE + 0x04)
#define CRS_ISR         REGISTER_32(CRS_BASE + 0x08)
#define CRS_ICR         REGISTER_32(CRS_BASE + 0x0c)

// I2C3
#define I2C3_CR1        REGISTER_32(I2C3_BASE + 0)
#define I2C3_CR2        REGISTER_32(I2C3_BASE + 4)
#define I2C3_OAR1       REGISTER_32(I2C3_BASE + 8)
#define I2C3_OAR2       REGISTER_32(I2C3_BASE + 0x0c)
#define I2C3_TIMINGR    REGISTER_32(I2C3_BASE + 0x10)
#define I2C3_TIMEOUTR   REGISTER_32(I2C3_BASE + 0x14)
#define I2C3_ISR        REGISTER_32(I2C3_BASE + 0x18)
#define I2C3_ICR        REGISTER_32(I2C3_BASE + 0x1c)
#define I2C3_PECR       REGISTER_32(I2C3_BASE + 0x20)
#define I2C3_RXDR       REGISTER_8(I2C3_BASE + 0x24)
#define I2C3_TXDR       REGISTER_8(I2C3_BASE + 0x28)


// I2C1
#define I2C1_CR1        REGISTER_32(I2C1_BASE + 0)
#define I2C1_CR2        REGISTER_32(I2C1_BASE + 4)
#define I2C1_OAR1       REGISTER_32(I2C1_BASE + 8)
#define I2C1_OAR2       REGISTER_32(I2C1_BASE + 0x0c)
#define I2C1_TIMINGR    REGISTER_32(I2C1_BASE + 0x10)
#define I2C1_TIMEOUTR   REGISTER_32(I2C1_BASE + 0x14)
#define I2C1_ISR        REGISTER_32(I2C1_BASE + 0x18)
#define I2C1_ICR        REGISTER_32(I2C1_BASE + 0x1c)
#define I2C1_PECR       REGISTER_32(I2C1_BASE + 0x20)
#define I2C1_RXDR       REGISTER_8(I2C1_BASE + 0x24)
#define I2C1_TXDR       REGISTER_8(I2C1_BASE + 0x28)


// USART2
#define USART2_CR1      REGISTER_32(USART2_BASE + 0)
#define USART2_CR2      REGISTER_32(USART2_BASE + 4)
#define USART2_CR3      REGISTER_32(USART2_BASE + 8)
#define USART2_BRR      REGISTER_32(USART2_BASE + 0x0c)
#define USART2_GTPR     REGISTER_32(USART2_BASE + 0x10)
#define USART2_RTOR     REGISTER_32(USART2_BASE + 0x14)
#define USART2_RQR      REGISTER_32(USART2_BASE + 0x18)
#define USART2_ISR      REGISTER_32(USART2_BASE + 0x1c)
#define USART2_ICR      REGISTER_32(USART2_BASE + 0x20)
#define USART2_RDR      REGISTER_32(USART2_BASE + 0x24)
#define USART2_TDR      REGISTER_32(USART2_BASE + 0x28)

// SPI3
#define SPI3_CR1        REGISTER_32(SPI3_BASE + 0)
#define SPI3_CR2        REGISTER_32(SPI3_BASE + 4)
#define SPI3_SR         REGISTER_32(SPI3_BASE + 8)
#define SPI3_DR         REGISTER_16(SPI3_BASE + 0x0c)
#define SPI3_DR8        REGISTER_8(SPI3_BASE + 0x0c)
#define SPI3_CRCPR      REGISTER_32(SPI3_BASE + 0x10)
#define SPI3_RXCRCR     REGISTER_32(SPI3_BASE + 0x14)
#define SPI3_TXCRCR     REGISTER_32(SPI3_BASE + 0x18)

