fduignan/stm32l432_nucleo/Serial/stm32l432.h
// IWDG 
#define IWDG_KR         REGISTER_32(IWDG_BASE + 0x00)
#define IWDG_PR         REGISTER_32(IWDG_BASE + 0x04)
#define IWDG_RLR        REGISTER_32(IWDG_BASE + 0x08)
#define IWDG_SR         REGISTER_32(IWDG_BASE + 0x0c)
#define IWDG_WINR       REGISTER_32(IWDG_BASE + 0x10)

// WWDG 
#define WWDG_CR         REGISTER_32(WWDG_BASE + 0x00)
#define WWDG_CFR        REGISTER_32(WWDG_BASE + 0x04)
#define WWDG_SR         REGISTER_32(WWDG_BASE + 0x08)


// RTC
#define RTC_TR          REGISTER_32(RTC_BASE + 0x00)
#define RTC_DR          REGISTER_32(RTC_BASE + 0x04)
#define RTC_CR          REGISTER_32(RTC_BASE + 0x08)
#define RTC_ISR         REGISTER_32(RTC_BASE + 0x0c)
#define RTC_PRER        REGISTER_32(RTC_BASE + 0x10)
#define RTC_WUTR        REGISTER_32(RTC_BASE + 0x14)
#define RTC_ALRMAR      REGISTER_32(RTC_BASE + 0x1c)
#define RTC_ALRMBR      REGISTER_32(RTC_BASE + 0x20)
#define RTC_WPR         REGISTER_32(RTC_BASE + 0x24)
#define RTC_SSR         REGISTER_32(RTC_BASE + 0x28)
#define RTC_SHIFTR      REGISTER_32(RTC_BASE + 0x2c)
#define RTC_TSTR        REGISTER_32(RTC_BASE + 0x30)
#define RTC_TSDR        REGISTER_32(RTC_BASE + 0x34)
#define RTC_TSSSR       REGISTER_32(RTC_BASE + 0x38)
#define RTC_CALR        REGISTER_32(RTC_BASE + 0x3c)
#define RTC_TAMPCR      REGISTER_32(RTC_BASE + 0x40)
#define RTC_ALRMASSR    REGISTER_32(RTC_BASE + 0x44)
#define RTC_ALRMBSSR    REGISTER_32(RTC_BASE + 0x48)
#define RTC_OR          REGISTER_32(RTC_BASE + 0x4c)
#define RTC_BKP0R       REGISTER_32(RTC_BASE + 0x50)
#define RTC_BKP1R       REGISTER_32(RTC_BASE + 0x54)
#define RTC_BKP2R       REGISTER_32(RTC_BASE + 0x58)
#define RTC_BKP3R       REGISTER_32(RTC_BASE + 0x5c)
#define RTC_BKP4R       REGISTER_32(RTC_BASE + 0x60)
#define RTC_BKP5R       REGISTER_32(RTC_BASE + 0x64)
#define RTC_BKP6R       REGISTER_32(RTC_BASE + 0x68)
#define RTC_BKP7R       REGISTER_32(RTC_BASE + 0x6c)
#define RTC_BKP8R       REGISTER_32(RTC_BASE + 0x70)
#define RTC_BKP9R       REGISTER_32(RTC_BASE + 0x74)
#define RTC_BKP10R      REGISTER_32(RTC_BASE + 0x78)
#define RTC_BKP11R      REGISTER_32(RTC_BASE + 0x7c)
#define RTC_BKP12R      REGISTER_32(RTC_BASE + 0x80)
#define RTC_BKP13R      REGISTER_32(RTC_BASE + 0x84)
#define RTC_BKP14R      REGISTER_32(RTC_BASE + 0x88)
#define RTC_BKP15R      REGISTER_32(RTC_BASE + 0x8c)
#define RTC_BKP16R      REGISTER_32(RTC_BASE + 0x90)
#define RTC_BKP17R      REGISTER_32(RTC_BASE + 0x94)
#define RTC_BKP18R      REGISTER_32(RTC_BASE + 0x98)
#define RTC_BKP19R      REGISTER_32(RTC_BASE + 0x9c)
#define RTC_BKP20R      REGISTER_32(RTC_BASE + 0xa0)
#define RTC_BKP21R      REGISTER_32(RTC_BASE + 0xa4)
#define RTC_BKP22R      REGISTER_32(RTC_BASE + 0xa8)
#define RTC_BKP23R      REGISTER_32(RTC_BASE + 0xac)
#define RTC_BKP24R      REGISTER_32(RTC_BASE + 0xb0)
#define RTC_BKP25R      REGISTER_32(RTC_BASE + 0xb4)
#define RTC_BKP26R      REGISTER_32(RTC_BASE + 0xb8)
#define RTC_BKP27R      REGISTER_32(RTC_BASE + 0xbc)
#define RTC_BKP28R      REGISTER_32(RTC_BASE + 0xc0)
#define RTC_BKP29R      REGISTER_32(RTC_BASE + 0xc4)
#define RTC_BKP30R      REGISTER_32(RTC_BASE + 0xc8)
#define RTC_BKP31R      REGISTER_32(RTC_BASE + 0xcc)


// TIM7 
#define TIM7_CR1        REGISTER_32(TIM7_BASE + 0)
#define TIM7_CR2        REGISTER_32(TIM7_BASE + 4)
#define TIM7_DIER       REGISTER_32(TIM7_BASE + 0x0c)
#define TIM7_SR         REGISTER_32(TIM7_BASE + 0x10)
#define TIM7_EGR        REGISTER_32(TIM7_BASE + 0x14)
#define TIM7_CNT        REGISTER_32(TIM7_BASE + 0x24)
#define TIM7_PSC        REGISTER_32(TIM7_BASE + 0x28)
#define TIM7_ARR        REGISTER_32(TIM7_BASE + 0x2c)

// TIM6 
#define TIM6_CR1        REGISTER_32(TIM6_BASE + 0)
#define TIM6_CR2        REGISTER_32(TIM6_BASE + 4)
#define TIM6_DIER       REGISTER_32(TIM6_BASE + 0x0c)
#define TIM6_SR         REGISTER_32(TIM6_BASE + 0x10)
#define TIM6_EGR        REGISTER_32(TIM6_BASE + 0x14)
#define TIM6_CNT        REGISTER_32(TIM6_BASE + 0x24)
#define TIM6_PSC        REGISTER_32(TIM6_BASE + 0x28)
#define TIM6_ARR        REGISTER_32(TIM6_BASE + 0x2c)

// TIM2
#define TIM2_CR1        REGISTER_32(TIM2_BASE + 0)
#define TIM2_CR2        REGISTER_32(TIM2_BASE + 4)
#define TIM2_SMCR       REGISTER_32(TIM2_BASE + 8)
#define TIM2_DIER       REGISTER_32(TIM2_BASE + 0x0c)
#define TIM2_SR         REGISTER_32(TIM2_BASE + 0x10)
#define TIM2_EGR        REGISTER_32(TIM2_BASE + 0x14)
#define TIM2_CCMR1      REGISTER_32(TIM2_BASE + 0x18)
#define TIM2_CCMR2      REGISTER_32(TIM2_BASE + 0x1c)
#define TIM2_CCER       REGISTER_32(TIM2_BASE + 0x20)
#define TIM2_CNT        REGISTER_32(TIM2_BASE + 0x24)
#define TIM2_PSC        REGISTER_32(TIM2_BASE + 0x28)
#define TIM2_ARR        REGISTER_32(TIM2_BASE + 0x2c)
#define TIM2_RCR        REGISTER_32(TIM2_BASE + 0x30)
#define TIM2_CCR1       REGISTER_32(TIM2_BASE + 0x34)
#define TIM2_CCR2       REGISTER_32(TIM2_BASE + 0x38)
#define TIM2_CCR3       REGISTER_32(TIM2_BASE + 0x3c)
#define TIM2_CCR4       REGISTER_32(TIM2_BASE + 0x40)
#define TIM2_DCR        REGISTER_32(TIM2_BASE + 0x48)
#define TIM2_DMAR       REGISTER_32(TIM2_BASE + 0x4c)
#define TIM2_OR         REGISTER_32(TIM2_BASE + 0x50)

// Core peripherals
#define STK_BASE        0xe000e010
#define SCB_BASE        0xe0000000
#define NVIC_BASE       0xe000e100


// NVIC
#define ISER0           REGISTER_32(NVIC_BASE + 0x000)
#define ISER1           REGISTER_32(NVIC_BASE + 0x004)
#define ISER2           REGISTER_32(NVIC_BASE + 0x008)
#define ISER3           REGISTER_32(NVIC_BASE + 0x00c)
#define ISER4           REGISTER_32(NVIC_BASE + 0x010)
#define ISER5           REGISTER_32(NVIC_BASE + 0x014)
#define ISER6           REGISTER_32(NVIC_BASE + 0x018)
#define ISER7           REGISTER_32(NVIC_BASE + 0x01c)

#define ICER0           REGISTER_32(NVIC_BASE + 0x080)
#define ICER1           REGISTER_32(NVIC_BASE + 0x084)
#define ICER2           REGISTER_32(NVIC_BASE + 0x088)
#define ICER3           REGISTER_32(NVIC_BASE + 0x08c)
#define ICER4           REGISTER_32(NVIC_BASE + 0x090)
#define ICER5           REGISTER_32(NVIC_BASE + 0x094)
#define ICER6           REGISTER_32(NVIC_BASE + 0x098)
#define ICER7           REGISTER_32(NVIC_BASE + 0x09c)


