fduignan/stm32l432_nucleo/Serial/stm32l432.h
#define ISPR0           REGISTER_32(NVIC_BASE + 0x100)
#define ISPR1           REGISTER_32(NVIC_BASE + 0x104)
#define ISPR2           REGISTER_32(NVIC_BASE + 0x108)
#define ISPR3           REGISTER_32(NVIC_BASE + 0x10c)
#define ISPR4           REGISTER_32(NVIC_BASE + 0x110)
#define ISPR5           REGISTER_32(NVIC_BASE + 0x114)
#define ISPR6           REGISTER_32(NVIC_BASE + 0x118)
#define ISPR7           REGISTER_32(NVIC_BASE + 0x11c)

#define ICPR0           REGISTER_32(NVIC_BASE + 0x180)
#define ICPR1           REGISTER_32(NVIC_BASE + 0x184)
#define ICPR2           REGISTER_32(NVIC_BASE + 0x188)
#define ICPR3           REGISTER_32(NVIC_BASE + 0x18c)
#define ICPR4           REGISTER_32(NVIC_BASE + 0x190)
#define ICPR5           REGISTER_32(NVIC_BASE + 0x194)
#define ICPR6           REGISTER_32(NVIC_BASE + 0x198)
#define ICPR7           REGISTER_32(NVIC_BASE + 0x19c)

#define IABR0           REGISTER_32(NVIC_BASE + 0x200)
#define IABR1           REGISTER_32(NVIC_BASE + 0x204)
#define IABR2           REGISTER_32(NVIC_BASE + 0x208)
#define IABR3           REGISTER_32(NVIC_BASE + 0x20c)
#define IABR4           REGISTER_32(NVIC_BASE + 0x210)
#define IABR5           REGISTER_32(NVIC_BASE + 0x214)
#define IABR6           REGISTER_32(NVIC_BASE + 0x218)
#define IABR7           REGISTER_32(NVIC_BASE + 0x21c)

#define IPR0            REGISTER_32(NVIC_BASE + 0x300)
#define IPR1            REGISTER_32(NVIC_BASE + 0x304)
#define IPR2            REGISTER_32(NVIC_BASE + 0x308)
#define IPR3            REGISTER_32(NVIC_BASE + 0x30c)
#define IPR4            REGISTER_32(NVIC_BASE + 0x310)
#define IPR5            REGISTER_32(NVIC_BASE + 0x314)
#define IPR6            REGISTER_32(NVIC_BASE + 0x318)
#define IPR7            REGISTER_32(NVIC_BASE + 0x31c)
#define IPR8            REGISTER_32(NVIC_BASE + 0x320)
#define IPR9            REGISTER_32(NVIC_BASE + 0x324)
#define IPR10           REGISTER_32(NVIC_BASE + 0x328)
#define IPR11           REGISTER_32(NVIC_BASE + 0x32c)
#define IPR12           REGISTER_32(NVIC_BASE + 0x330)
#define IPR13           REGISTER_32(NVIC_BASE + 0x334)
#define IPR14           REGISTER_32(NVIC_BASE + 0x338)
#define IPR15           REGISTER_32(NVIC_BASE + 0x33c)
#define IPR16           REGISTER_32(NVIC_BASE + 0x340)
#define IPR17           REGISTER_32(NVIC_BASE + 0x344)
#define IPR18           REGISTER_32(NVIC_BASE + 0x348)
#define IPR19           REGISTER_32(NVIC_BASE + 0x34c)
#define IPR20           REGISTER_32(NVIC_BASE + 0x350)
#define IPR21           REGISTER_32(NVIC_BASE + 0x354)
#define IPR22           REGISTER_32(NVIC_BASE + 0x358)
#define IPR23           REGISTER_32(NVIC_BASE + 0x35c)
#define IPR24           REGISTER_32(NVIC_BASE + 0x360)
#define IPR25           REGISTER_32(NVIC_BASE + 0x364)
#define IPR26           REGISTER_32(NVIC_BASE + 0x368)
#define IPR27           REGISTER_32(NVIC_BASE + 0x36c)
#define IPR28           REGISTER_32(NVIC_BASE + 0x370)
#define IPR29           REGISTER_32(NVIC_BASE + 0x374)
#define IPR30           REGISTER_32(NVIC_BASE + 0x378)
#define IPR31           REGISTER_32(NVIC_BASE + 0x37c)
#define IPR32           REGISTER_32(NVIC_BASE + 0x380)
#define IPR33           REGISTER_32(NVIC_BASE + 0x384)
#define IPR34           REGISTER_32(NVIC_BASE + 0x388)
#define IPR35           REGISTER_32(NVIC_BASE + 0x38c)
#define IPR36           REGISTER_32(NVIC_BASE + 0x390)
#define IPR37           REGISTER_32(NVIC_BASE + 0x394)
#define IPR38           REGISTER_32(NVIC_BASE + 0x398)
#define IPR39           REGISTER_32(NVIC_BASE + 0x39c)
#define IPR40           REGISTER_32(NVIC_BASE + 0x3a0)
#define IPR41           REGISTER_32(NVIC_BASE + 0x3a4)
#define IPR42           REGISTER_32(NVIC_BASE + 0x3a8)
#define IPR43           REGISTER_32(NVIC_BASE + 0x3ac)
#define IPR44           REGISTER_32(NVIC_BASE + 0x3b0)
#define IPR45           REGISTER_32(NVIC_BASE + 0x3b4)
#define IPR46           REGISTER_32(NVIC_BASE + 0x3b8)
#define IPR47           REGISTER_32(NVIC_BASE + 0x3bc)
#define IPR48           REGISTER_32(NVIC_BASE + 0x3c0)
#define IPR49           REGISTER_32(NVIC_BASE + 0x3c4)
#define IPR50           REGISTER_32(NVIC_BASE + 0x3c8)
#define IPR51           REGISTER_32(NVIC_BASE + 0x3cc)
#define IPR52           REGISTER_32(NVIC_BASE + 0x3d0)
#define IPR53           REGISTER_32(NVIC_BASE + 0x3d4)
#define IPR54           REGISTER_32(NVIC_BASE + 0x3d8)
#define IPR55           REGISTER_32(NVIC_BASE + 0x3dc)
#define IPR56           REGISTER_32(NVIC_BASE + 0x3e0)
#define IPR57           REGISTER_32(NVIC_BASE + 0x3e4)
#define IPR58           REGISTER_32(NVIC_BASE + 0x3e8)
#define IPR59           REGISTER_32(NVIC_BASE + 0x3ec)

// STK
#define STK_CSR         REGISTER_32(STK_BASE + 0)
#define STK_RVR         REGISTER_32(STK_BASE + 4)
#define STK_CVR         REGISTER_32(STK_BASE + 8)
#define STK_CALIB       REGISTER_32(STK_BASE + 0x0c)

// SCB
#define ACTLR           REGISTER_32(SCB_BASE + 0xe008)
#define CPUID           REGISTER_32(SCB_BASE + 0xed00)
#define ICSR            REGISTER_32(SCB_BASE + 0xed04)
#define VTOR            REGISTER_32(SCB_BASE + 0xed08)
#define AIRCR           REGISTER_32(SCB_BASE + 0xed0c)
#define SCR             REGISTER_32(SCB_BASE + 0xed10)
#define CCR             REGISTER_32(SCB_BASE + 0xed14)
#define SHPR2           REGISTER_32(SCB_BASE + 0xed1c)
#define SHPR3           REGISTER_32(SCB_BASE + 0xed20)
#define SHCSR           REGISTER_32(SCB_BASE + 0xed24)
#define DFSR            REGISTER_32(SCB_BASE + 0xed30)
#define CPAC            REGISTER_32(SCB_BASE + 0xed88)
